{
	"name": "English",
	"terms": [{
		"profile_photo": {
			"name": "REAL ESTATE INVESTMENT IN BUENOS AIRES",
			"position": "Final work of EANT - Data Scientist career",
			"change": "Change to",
			"section": "Home"
		},
		"profile_about": {
			"title": "Introduction",
			"paragraph_1": "If I had to buy a department as an investment, where would I do it?",
			"paragraph_2": "The main idea of the work will be to predict the location of the property in which the greatest increase in the price will be obtained, for the following year, based on the recognition of the variables that determine that the increase is greater than a defined threshold.",
			"paragraph_3": "The threshold is defined as the 90th percentile.",
			"section": "Introduction"
		},
		"profile_base": {
			"title": "Databases",
			"paragraph_1": "The databases were obtained from the <a href='https://data.buenosaires.gob.ar/' target='_blank'>Government of the City of Buenos Aires website</a> and are the following:",
			"paragraph_2": "- Departments for sale of Buenos aires city during the years 2007 - 2015<br />- Private Health Centers<br />- Health Centers and Community Action<br />- Medical Centers Neighborhoods<br />- Police stations<br />- Educational establishments<br />- Subway stations<br />- Metrobus stations<br />- Railway stations<br />- Clubs<br />- Hospitals<br />- Barracks and police fire stations<br />- Bus stops<br />- Cultural dependencies<br />- Pharmacies<br />- Universities",
			"section": "Databases"
		},
		"profile_preprouno": {
			"title": "Process",
			"paragraph_1": "For processing, the programming language R was used and was covered in three stages:",
			"paragraph_2": "FIRST STAGE",
			"paragraph_3": "The first stage of the process was to take the databases of the departments for sale from 2007 to 2015 and then unify them into a single database. To do this, we take these databases and filter them by the columns they have in common. Particularly, for the data set of 2015 departments, the names of some columns in common with the rest of the databases did not coincide completely, so it was necessary to rename these columns: as 'NEIGHBORHOODS' for 'NEIGHBORHOOD', 'TRUNK' for 'BASEMENT', etc. to be able to conclude with the unification of these databases.",
			"paragraph_4": "Before unifying the databases, to each of them we assign a new column 'YEAR' that indicates the corresponding year of sales. This helps us to know what year is the sale of the department in the database that we generate when unifying, since with the passing of the years the prices increase.",
			"paragraph_5": "SECOND STAGE",
			"paragraph_6": "The second stage of the process was to manipulate each of the columns of the previously generated dataset:",
			"paragraph_7": "- Latitude and Longitude: In these columns we filter gaps and make sure that the coordinates have the whole part with two digits and the decimal part with at least four digits (with fewer digits the accuracy was lost and the location already differed in several blocks), both parties separated by a point. The points indicating the thousands separators were also eliminated, except for the point that separates the whole part with the decimal part, and the erroneous coordinates were eliminated (latitudes of 4700 and other similar numbers were detected among them). Generally, the latitudes and longitudes of the data have a whole part (-58, - 34.), so we are guided with both values, the rest is considered erroneous.",
			"paragraph_8": "- Terrace: Initially it was thought that this column only indicated with an YES or with a NO if the apartment has a terrace, but unfortunately we saw that it contains different values such as BALCONY, YARD, TERRACE, YES, NO, YARD AND TERRACE, etc. or any concatenation of these values. For this we propose to build three new columns: YARD, TERRACE and BALCONY, to indicate if the department owns each one of these things separately. To accomplish this, these columns were built from a Boolean vector that indicates whether the word 'BALCONY', 'YARD' or 'TERRACE' are part of the value (string) in question, marking with 1 if it has or with 0 if it does not have. In this way, for example, a value like 'YARD AND BALCONY' will assign TRUE (1) to both the YARD column and the BALCONY column, since it contains both words.",
			"paragraph_9": "- M2 (square meters): Here in addition to filtering the NA, those departments that have less than 14 square meters have also been filtered, since they do not make sense.",
			"paragraph_10": "- Dollars per square meter: We noticed some typing errors, for example, it was observed that some decimal numbers have a point (which is the right thing) while others have a comma (which needed to be corrected).",
			"paragraph_11": "- Dollars: Values from 0 to 131 dollars were observed, which does not make sense those prices for a department. To correct these values, instead of filtering them, we replace them with the product of their price in dollars per square meter and their square meters.",
			"paragraph_12": "- Baños: Para el tema de los baños fue complicado, ya que se encontraron valores con NA, valores con 0 baños y valores mal tipeados con miles de baños. Decimos que fue complicado por lo siguiente: Por un lado, la cantidad de estos datos erróneos (sobre todo los de 0 baños) sumaban aproximadamente 40000 observaciones, casi la 3era parte de todo nuestro set de datos (que cuenta con unas 125000 observaciones), por lo que eliminarlos o filtrarlos era un grave problema debido a que se perdían muchos datos. Por otro lado, si reemplazábamos estos datos erróneos por una determinada cantidad de baños, por ejemplo por 1, vamos a tener el problema de introducir datos erróneos en gran cantidad de estas observaciones, ya que es muy factible que en 40000 observaciones hayan departamentos con más de 1 baño. A esto lo llamamos como el problema de los cero baños.<br /><br />La solución a esto fue lo siguiente: Predecir la cantidad de baños en base a los metros cuadrados del departamento. Para ello se construyó un boxplot sobre los metros cuadrados en función de la cantidad de baños y de ahí sacar las conclusiones. De esta manera no nos aseguramos un 100% de aciertos pero sí la gran mayoría de ellos. A continuación se muestra el diagrama del boxplot en la que se estudió la cantidad de baños según los metros cuadrados de los departamentos:",
			"paragraph_13": "<center><img src='https://raw.githubusercontent.com/Pabloino/tp-eant-blog/gh-pages/assets/img/boxplot-baños.png' style='max-height: 100%; max-width: 100%;'></center>",
			"paragraph_14": "Este gráfico fué realizado con una librería de R que permite interactuar con el gráfico (que no es posible interactuar aquí por el hecho de ser solo una imagen), siendo muy util para observar los valores límite de cada caja. Lo que mostró el gráfico es que cada rango de metros cuadrados (M2) suele tener frecuentemente la siguiente cantidad de baños:<br /><br />Entre 14 y 69: 1 baño.<br />Entre 70 y 118: 2 baños.<br />Entre 119 y 175: 3 baños.<br />Entre 176 y 238: 4 baños.<br />Entre 239 y 310: 5 baños.<br />De 311 en adelante: 6 baños.<br /><br />Cabe destacar que en el set de datos, además de los 0 baños, mencionamos que también hubo unos pocos datos erróneos que marcaban desde los 7 a los miles de baños. Esto quiere decir que fue necesario establecer un límite superior a la cantidad de baños aceptables. Para ello, se investigaron aquellos departamentos de la ciudad que cuentan con la mayor cantidad posible de baños, a lo que se observó que no hay departamentos con más de 6 baños. Además, notamos que esto tiene sentido al observar el set de datos ya que cuanto más baños, menor cantidad de observaciones hay en el set, esto quiere decir que partiendo de 1 baño, la cantidad de observaciones iban diminuyendo cada vez más rápido hasta los 6 baños (con 350 observaciones aproximadamente), y luego en los 7 baños realizaba un gran salto (de 350 a unas 5 observaciones aproximadamente), concluyendo que allí se encuentra el tope máximo.",
			"paragraph_15": "- Ambientes: Con los ambientes pasó lo mismo que con los baños, ya sea valores con NA, con 0 ambientes, con miles, etc. Aplicando el mismo método que hicimos con los baños, predecimos la cantidad de ambientes según el metro cuadrado mediante el siguiente boxplot:",
			"paragraph_16": "<center><img src='https://raw.githubusercontent.com/Pabloino/tp-eant-blog/gh-pages/assets/img/boxplot-amb.png' style='max-height: 100%; max-width: 100%;'></center>",
			"paragraph_17": "El gráfico de boxplot muestra que podríamos predecir hasta 6 ambientes, ya que con más ambientes tenemos pocos datos y probablemente erróneos, ya que hay departamentos de muchos ambientes con pocos metros cuadrados, la cual no tiene sentido. Con este gráfico se estimó la cantidad de ambientes para los siguientes rangos de metros cuadrados:<br /><br />Entre 14 y 42: 1 ambiente.<br />Entre 43 y 59: 2 ambientes.<br />Entre 60 y 89: 3 ambientes.<br />Entre 90 y 149: 4 ambientes.<br />Entre 150 y 260: 5 ambientes.<br />Entre 261 y 285: 6 ambientes.<br /><br />Para el resto de los metros cuadrados, es decir de 285 en adelante, los eliminamos ya que abarcan unos pocos cientos de datos.",
			"paragraph_18": "- Barrio: No se encontraron valores NA pero sí algunos errores de tipeo que tuvieron que ser corregidos, como 'NUNES' por 'NUÑEZ', 'MONSERRAT' por 'MONTSERRAT', etc.",
			"paragraph_29": "- Para el resto de las columnas, sean 'LAVADERO', 'BAULERA' y 'COCHERA', simplemente se reemplazó con 1 si posee tal propiedad y 0 si no la posee.",
			"paragraph_20": "TERCERA ETAPA",
			"paragraph_21": "En la tercera etapa del proceso se agregaron los puntos de interés cercanos a cada departamento, ya sean paradas de colectivo, subtes, trenes, farmacias, centros de salud, comisarías, etc. Esto nos dá una idea acerca de la ubicación de cada departamento, es decir si se encuentra en una zona céntrica o comercial o está alejado del centro, lo cual difiere en precio de las ventas. Para ello, se estableció por cada departamento un radio de 5 manzanas alrededor del mismo para luego observar los puntos de interés que caen dentro del área, representando los lugares cercanos al departamento. A continuación se ilustra un ejemplo sobre este planteo:",
			"paragraph_22": "<center><img src='https://raw.githubusercontent.com/Pabloino/tp-eant-blog/gh-pages/assets/img/bsas-interes.png' style='max-height: 100%; max-width: 100%;'></center>",
			"paragraph_23": "De esta manera, en el dataset, cada departamento tendrá una columna para cada punto de interés en la que indica la cantidad de cada uno de estos lugares dentro del radio de 5 cuadras, mostrando qué puntos de interés se encuentran cerca del departamento, a menos de 5 cuadras. Esto muestra una idea sobre la ubicación del departamento, ya que cuanto más puntos de interés se encuentren dentro del radio, más céntrica es la zona de ubicación.",
			"section": "Process"
		},
		"profile_agrup": {
			"title": "Agrupación",
			"paragraph_1": "Una vez finalizada el procesamiento de los datos, los agrupamos por Radios Censales. La idea principal de agrupar la base se debe a que, dado que vamos a comparar la variación del precio del metro cuadrado año a año, no vamos a poder contar con los mismos departamentos en cada año ya que hay departamentos que se venden mientras por otro lado surgen nuevos departamentos en venta. Debido a este motivo, la comparación se realizará entre distintos grupos.",
			"paragraph_2": "Para ello contamos con una base de radios censales que contiene información como latitud, longitud, ubicación, grupo, población, hogares, viviendas, etc. que será unificada con la base de las ventas de departamentos generada anteriormente mediante la longitud y latitud cuyos datos tienen ambas bases en común. De esta forma, la base de radios censales nos permitirá agrupar en 3371 grupos.",
			"paragraph_3": "Una vez unificada las bases, agrupamos los datos por 'AÑO' y por 'GRUPO', y para cada uno de ellos obtenemos la media de los metros cuadrados, dólares, precio por metro cuadrado, ambientes, baulera, cochera, baño, lavadero, balcón, terraza y patio. En cuanto a la cantidad de lugares de interés cercanos, usamos la suma de los mismos para la agrupación.",
			"paragraph_4": "Al obtener dichas agrupaciones, para cada grupo, sacamos la variación del precio por metro cuadrado año a año, y luego calculamos el promedio de las variaciones de los años 2007-2015. Usamos promedios debido a que hay varios grupos donde no tienen alguna de las variaciones anuales, por no tener departamentos en el grupo en alguno de los años observados.",
			"section": "Agrupación"
		},
		"copyright": "Copyright © 2016 Rodrigo Donini. Made with ♥ and <a href='https://jekyllrb.com/' target='_blank'>Jekyll</a> fork on <a href='https://github.com/donini/personal-page' target='_blank'>Github</a>."
	}]
}
