{
	"name": "Spanish",
	"terms": [{
		"profile_photo": {
			"name": "INVERSIÓN INMOBILIARIA EN BUENOS AIRES",
			"position": "Trabajo final de EANT - Carrera de Data Scientist",
			"change": "Cambiar a",
			"section": "Inicio"
		},
		"profile_about": {
			"title": "Introducción",
			"paragraph_1": "Si tuvieras que comprar un departamento como inversión, ¿Dónde lo harías?",
			"paragraph_2": "La idea principal del trabajo será predecir, la localización del inmueble en el cual se obtendrá el mayor incremento en el precio, para el año siguiente, en base al reconocimiento de las variables que determinan que el incremento sea mayor a un umbral definido.",
			"paragraph_3": "El umbral se definirá como el percentil 90.",
			"section": "Introducción"
		},
		"profile_base": {
			"title": "Bases de datos",
			"paragraph_1": "Las bases fueron obtenidas de la <a href='https://data.buenosaires.gob.ar/' target='_blank'>web del Gobierno de la Ciudad</a> y son las siguientes:",
			"paragraph_2": "- Departamentos en venta de Capital Federal durante los años 2007 - 2015<br />- Centros de Salud Privado<br />- Centros de Salud y Acción Comunitaria<br />- Centros Médicos Barriales<br />- Comisarías<br />- Establecimientos Educativos<br />- Estaciones de Subte<br />- Estaciones de Metrobus<br />- Estaciones de Ferrocarril<br />- Clubes<br />- Hospitales<br />- Cuarteles y destacamientos de bomberos de Policía<br />- Paradas de Colectivo<br />- Dependencias Culturales<br />- Farmacias<br />- Universidades",
			"section": "Bases de datos"
		},
		"profile_preprouno": {
			"title": "Procesamiento",
			"paragraph_1": "PRIMERA PARTE",
			"paragraph_2": "La primera parte del proceso consistió en tomar las bases de los departamentos en venta del 2007 al 2015 para luego unificarlos en una sola base. Para ello, tomamos dichas bases y las filtramos por las columnas que tengan en común. Particularmente, para el set de datos de departamentos del 2015, los nombres de algunas columnas en común con el resto de las bases no coincidian completamente, por lo que fue necesario renombrar dichas columnas: como 'Barrios' por 'Barrio', 'Baul' por 'Baulera', etc. para poder concluir con la unificación de estas bases.",
			"paragraph_3": "Antes de unificar las bases, a cada una de las mismas le asignamos una nueva columna 'Año' que indique el año correspondiente de las ventas. Esto nos ayudará a saber de qué año es la venta del departamento en la base que generamos al unificar, ya que con el pasar de los años los precios van aumentando.",
			"paragraph_4": "Para más información sobre la implementación y manipulación de esta etapa, pueden acceder <a href='https://github.com/Pabloino/tp-final-eant/blob/master/preprocesamiento.ipynb' target='_blank'>en este repositorio</a>.",
			"section": "Procesamiento"
		},
		"copyright": "Copyright © 2016 Rodrigo Donini. Made with ♥ and <a href='https://jekyllrb.com/' target='_blank'>Jekyll</a> fork on <a href='https://github.com/donini/personal-page' target='_blank'>Github</a>."
	}]
}
